
https://otvet.mail.ru/question/224077136

Задача 4. Число наоборот 3
Пользователь вводит два вещественных числа — N и K. Напишите программу, которая отдельно заменяет сначала целую часть на число, 
которое получается из исходного записью его цифр в обратном порядке, затем то же самое делает с дробной частью. 
После этого числа складываются и сумма выводится на экран.
Пример:
Введите первое число: 102.12
Введите второе число: 123.34
Первое число наоборот: 201.21
Второе число наоборот: 321.43
Сумма: 522.64

Вот самый подходящий вариант для товарищей из Skillbox):

def turn_numbers1(N):
number = 0
main_part = round(N, 1) // 1
print(main_part)
while main_part > 0:
rest = main_part % 10
main_part = main_part // 10
number = number * 10
number = number + rest
print(number)
return number

def turn_numbers2(N):
number2 = 0
residual_part = round(N - (N // 1), 2) * 100
print(residual_part)
while residual_part > 0:
rest = (round((N - (N // 1)), 2) * 100) % 10
residual_part = residual_part // 10
number2 = number2 + rest
number2 = number2 * 10 - 0.1
number2 /= 1000
return number2

N1 = float(input("Введите первое вещественное число: "))

reverse_N1_main = turn_numbers1(N1)
reverse_N1_residual = turn_numbers2(N1)
reverse_N1 = reverse_N1_main + reverse_N1_residual
print("1ое число наоборот: ", reverse_N1)

N2 = float(input("Введите второе вещественное число: "))

reverse_N2_main = turn_numbers1(N2)
reverse_N2_residual = turn_numbers2(N2)
reverse_N2 = reverse_N2_main + reverse_N2_residual
print("2ое число наоборот: ", reverse_N2)

summ_reversed_num = reverse_N1 + reverse_N2
print("Сумма: ", summ_reversed_num)



